migrate text diagrams to mermaid
